import { Button, Grid, TextField, Typography } from "@mui/material";
import { Box, Container } from "@mui/system";
import React from "react";

const AboutUs = () => {
  return (
    <>
      <Container sx={{ maxWidth: "mg", marginBottom: "40px" }}>
        <Typography sx={{ marginTop: "40px", fontSize: "20px" }}>
          Almurut - самый большой оффлайн и онлайн-ритейлер в стране. Уже более
          5 лет мы воплощаем маленькие мечты и грандиозные планы миллионов
          людей. У нас можно найти буквально все и по справедливой цене. Мы
          предоставляем гарантию, так как считаем, что онлайн-шопинг должен быть
          максимально удобным и безопасным. И каждый раз, когда вы нажимаете
          «Купить», мы понимаем, что делаем нужное дело
        </Typography>
        <Typography sx={{ marginTop: "15px" }} variant="h4" color="orange">
          Мы
        </Typography>
        <Typography sx={{ fontSize: "20px" }}>
          К нам обычно приходят за техникой. Мы делаем много видео и постов в
          Instagram - это все для того, чтобы первыми познакомиться с вами
          Конечно же, Almurut store для нас это не только магазин техники для
          вас. Мы нечто большее, чем просто магазин…
        </Typography>
        <Typography sx={{ marginTop: "15px" }} variant="h4" color="orange">
          Интересно? Читайте дальше
        </Typography>
        <Typography sx={{ marginTop: "10px", fontSize: "20px" }}>
          В Almurut store, когда мы говорим “обслужены тысячу” мы говорим не
          только о телефонах и ноутбуках. Мы говорим об обслуживании наших
          Людей. Как ведущий ритейлер электронной техники в стране, мы считаем
          своей обязанностью сделать наше влияние на страну положительным. Мы
          верим в использование нашего влияния, размера и охвата, а также
          взаимодействия с клиентами Almurut store, сотрудниками компании в
          качестве ответственного бизнеса, оказывающее положительное влияние на
          всю страну. Действия, которые мы предпринимаем гарантируют, что мы
          строим лучший бизнес и более надежный бренд для будущего поколения Мы
          гордимся работой, которую мы делаем, чтобы помочь изменить ситуацию, и
          будем продолжать работать над достижением прогресса в нашей стране.
        </Typography>
        <Typography sx={{ marginTop: "15px" }} variant="h4" color="orange">
          Покупая у нас технику Вы делаете вклад в благотворительность
        </Typography>
        <Typography sx={{ marginTop: "10px", fontSize: "20px" }}>
          Мы оказываем влияние, живя нашей целью. Мы не только помогаем вам
          выбрать технику, но и помогаем в развитии страны, а также нуждающимся.
          А руководствуясь нашими ценностями, мы стараемся стать лучшими
          союзниками, лучшими спонсорами и лучшими лидерами, помогая расширить
          возможности людей и сообществ, которым мы служим. Центральное место в
          достижении этой цели занимает уважение прав человека везде, где мы
          ведем бизнес.
        </Typography>
        <Typography sx={{ marginTop: "15px" }} variant="h4" color="orange">
          Наша команда
        </Typography>
        <Typography sx={{ marginTop: "10px", fontSize: "20px" }}>
          Предоставление лучшего в своем классе опыта сотрудников, когда людям
          предоставляются возможности учиться и развиваться, является
          бизнес-императивом, поскольку оно напрямую влияет на качество
          обслуживания клиентов. Ежедневно в магазин Almurut store приходят
          более (тысячи) посетителей. А технику у нас разбирают как горячие
          пирожки. Вы только что ознакомились с нашей компанией. Наша семья -
          это прогрессивные, дружелюбные и целеустремленные люди. Каждый из нас
          глубоко проник ценностями и миссией компании. А миссия у нас звучит
          так: “Обеспечить людям простые и выгодные решения на пути к мечте,
          наполненные качественной техникой лучших мировых брендов” Сразу же
          после миссии вам стоит узнать о наших ценностяx, 7 заповедей Almurut:
          <ul>
            <li>Единство и сплоченность команды</li>
            <li>Межкомандное партнерство, дружба, сотрудничество</li>
            <li>Честность, честь и патриотизм к компании</li>
            <li>
              Через кропотливый и неустанный труд и знания - к процветанию и
              благосостоянию
            </li>
            <li>Гуманизм, великодушие и терпимость</li>
            <li>Гармония с природой</li>
            <li>Укрепление и защита всего перечисленного</li>
          </ul>
        </Typography>
        <Typography sx={{ marginTop: "15px" }} variant="h4" color="orange">
          История создания
        </Typography>
        <Typography sx={{ marginTop: "10px", fontSize: "20px" }}>
          Вся история началась в мае 2017го года с подвала и двух работников -
          Василия Пупкина (основатель) и его помощника. Первую точку как вы
          поняли Василий Пупкин открыл в подвале ТЦ “ЦУМ”, а далее уже на первом
          этаже этого же торгового центра, но уже точек стало 4. Нет, это не
          конец истории - это только начало. В 2021 году открылся новый магазин
          в ТЦ “Евразия”, а в 2022 году второй магазин на Моссовете (Юсупа
          Абдрахманова, 129) и в этом же году третий магазин в ТЦ “Бишкек Парк”.
          Короче, точки в торговых центрах мы в обиде не оставляем. Про наши
          точки продаж вы узнали, расскажем теперь про самое интересное -
          нейминг.
        </Typography>
        <Typography sx={{ marginTop: "15px" }} variant="h4" color="orange">
          Все спрашивают: “Почему Almurut?”
        </Typography>
        <Typography sx={{ marginTop: "10px", fontSize: "20px" }}>
          А здесь уже начинается наша районовская история про то, кто и как
          придумал название компании Almurut… Сидели как-то Василий Пупкин со
          своим другом во дворе и думали про то, какое название дать магазину
          электронной техники. На тот момент никто кроме самого Василия не мог
          подумать что этот бизнес станет настолько масштабным, что о нем будет
          знать вся страна как про самую надежную сеть магазинов. Они генерили
          много названий, но многое им не подходило. И просто в один момент они
          по лайту решили поставить противоположное наименование самому
          распространенному бренду “Apple” - “Almurut” (это груша, если
          перевести с кыргызского языка). Да, как вы поняли у нас в компании все
          просто и открыто, мы можем рассказать вам не только про создание и
          рост нашей компании, но и качественно проконсультировать по поводу
          любой техники.
        </Typography>
        <Typography sx={{ marginTop: "15px" }} variant="h6" color="orange">
          С любовью, Almurut store!
        </Typography>
        <Grid>
          <Typography
            variant="h4"
            sx={{ display: "flex", justifyContent: "center" }}>
            Оставить заявку
          </Typography>
          <Box
            sx={{
              display: "flex",
              flexDirection: "column",
              justifyContent: "center",
            }}>
            <TextField
              id="outlined-basic"
              label="Ваше имя"
              variant="outlined"
            />
            <TextField
              id="outlined-basic"
              label="Ваш телефон"
              variant="outlined"
            />
            <Button variant="contained" color="warning">
              Отправить
            </Button>
          </Box>
        </Grid>
      </Container>
    </>
  );
};

export default AboutUs;
